Tekla Open API Reference for Tekla Structures 2025
Plugin.LoadStandardValues Method
 Sets the values from the specified file to this plug-in.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool LoadStandardValues(
	string Filename
)
Public Function LoadStandardValues (
	Filename As String
) As Boolean
Parameters
Filename
Type: System.String
The short name of the file containing the attributes.
Return Value
Type: Boolean
True on success. Otherwise, false.
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace